todo = dict()
k = 1
while True:
    print("Простой todo:", "\n", "1.Добавить задачу", "\n", "2.Вывести список задач", "\n", "3.Выход")
    x = input("Выберете действие: ")
    if x == "3":
        break
    if x == "1":
        a = input("Сформулируйте задачу ")
        b = input("Добавьте категорию к задаче ")
        c = input("Добавьте время к задаче ")
        todo[k] = ["Задача:", a, "\n", "Категория:", b, "\n", "Дата:", c]
        k = k + 1
    if x == "2":
        for i in range(1, len(todo)+1):
            print(" ".join(todo[i]))